Table of Contents
 Interface IIdeaConnectedMember
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Represent Connected Member - member 1D assigned in to connection
public interface IIdeaConnectedMember : IIdeaObjectConnectable, IIdeaPersistentObject, IIdeaObject
Inherited Members
 IIdeaPersistentObject.Token
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 AutoAddCutByWorkplane
Add automatically cut by work plane on beginning and end of member
bool AutoAddCutByWorkplane { get; }
Property Value
bool
 ConnectedMemberType
Connected member type [Structural|Stiffening|Negative]
IdeaConnectedMemberType ConnectedMemberType { get; set; }
Property Value
IdeaConnectedMemberType
 ForcesIn
Load forces placed in
IdeaForcesIn ForcesIn { get; set; }
Property Value
IdeaForcesIn
 GeometricalType
Member is [Continuous|Ended]
IdeaGeometricalType GeometricalType { get; }
Property Value
IdeaGeometricalType
 IdeaMember
member
IIdeaMember1D IdeaMember { get; }
Property Value
IIdeaMember1D
 IsBearing
Is member bearing?
bool IsBearing { get; }
Property Value
bool
 IsReferenceLineInCenterOfGravity
Is Cross section place on reference line or center of gravity - affected member offsets
bool IsReferenceLineInCenterOfGravity { get; }
Property Value
bool
 MemberSegmentType
Member segment type
IdeaBeamSegmentModelType MemberSegmentType { get; }
Property Value
IdeaBeamSegmentModelType
 Edit this page